import random, string

def generate_random_nickname():
    words = words = [
        '다람쥐', '토끼', '강아지', '고양이', '햄스터', '새', '거북이', '너구리', '여우', '판다', '코알라', '오리', '병아리', '참새', '펭귄',
        '나비', '부엉이', '사자', '호랑이', '코끼리', '고슴도치', '다람이', '토순이', '멍멍이', '냥이', '햄찌', '꿩', '두더지', '고라니',
        '알파카', '미어캣', '라마', '땃쥐', '날다람쥐', '천사고양이', '날치', '산토끼', '해달', '수달', '비버', '너구리', '무당벌레', '꿀벌',
        '버섯', '비둘기', '앵무새', '도마뱀', '개구리', '달팽이', '코뿔소', '물개', '바다사자', '바다거북', '펄럭이는참새', '노래하는고양이',
        '웃는햄스터', '마라', '미니피그', '장수풍뎅이', '수컷사슴벌레', '암컷사슴벌레', '젤리피쉬', '말미잘', '물고기', '돌고래', '거북이',
        '천둥새', '바다표범', '산양', '바다표범', '사막여우', '별사탕곰', '쿠키호랑이', '젤리곰', '푸딩토끼', '하늘여우', '숲속여우', '초코다람쥐',
        '카스테라햄스터', '오레오고양이', '참치강아지', '빼빼로새', '마카롱토끼', '머랭여우', '휘핑크림곰', '카라멜펭귄', '푸딩다람쥐',
        '캐러멜코알라', '크림치즈병아리', '버블젤리부엉이', '젤리펭귄', '쿠키거북이', '레몬새', '딸기햄스터', '초코고슴도치', '바나나펭귄',
        '블루베리토끼', '라즈베리부엉이', '체리강아지', '애플고양이',
    ]
    word = random.choice(words)
    suffix = ''.join(random.choices(string.ascii_letters + string.digits, k=5))
    return f'{word}{suffix}'